  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/add-vms` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/f648821f-7dec-4143-a992-c2afc34ac739/terraform-bin apply -no-color -auto-approve -compact-warnings
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

# module.k8s-node[0].azurerm_network_interface.nic will be updated in-place
~ resource "azurerm_network_interface" "nic" {
      id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic"
      name                          = "k8s-node-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

    ~ ip_configuration {
          name                          = "internal"
        + public_ip_address_id          = (known after apply)
          # (5 unchanged attributes hidden)
      }
  }

# module.k8s-node[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "k8s-node-0-public-ip"
    + resource_group_name     = "k8s"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

Plan: 1 to add, 1 to change, 0 to destroy.
module.k8s-node[0].azurerm_public_ip.public_ip[0]: Creating...
module.k8s-node[0].azurerm_public_ip.public_ip[0]: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/publicIPAddresses/k8s-node-0-public-ip]
module.k8s-node[0].azurerm_network_interface.nic: Modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic]
module.k8s-node[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...twork/networkInterfaces/k8s-node-0-nic, 10s elapsed]
module.k8s-node[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...twork/networkInterfaces/k8s-node-0-nic, 20s elapsed]
module.k8s-node[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...twork/networkInterfaces/k8s-node-0-nic, 30s elapsed]
module.k8s-node[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...twork/networkInterfaces/k8s-node-0-nic, 40s elapsed]
module.k8s-node[0].azurerm_network_interface.nic: Modifications complete after 42s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/k8s/providers/Microsoft.Network/networkInterfaces/k8s-node-0-nic]

Apply complete! Resources: 1 added, 1 changed, 0 destroyed.
```

  </details>